#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s
module.policy.aws_iam_role.get_company_permissions_lambda_exec_role: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.download_comparison_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_download_comparison_vs_peers_lambda_function]
module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object: Refreshing state... [id=lambdas/demo/verify_users_with_same_email_handler.zip]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo_rds_migrations]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.policy.aws_iam_role.add_investment_lambda_exec_role: Refreshing state... [id=demo_add_investment_lambda_exec_role]
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.logs.aws_cloudwatch_log_group.update_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_update_data_lambda_function]
module.logs.aws_cloudwatch_log_group.get_all_public_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_public_companies_lambda_function]
module.policy.aws_lambda_permission.apigw_authorize_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_iam_role.change_company_publicly_lambda_exec_role: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role]
module.policy.aws_iam_role.get_roles_lambda_exec_role: Refreshing state... [id=demo_get_roles_lambda_exec_role]
module.policy.aws_iam_role.get_dynamic_report_lambda_exec_role: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role]
module.policy.aws_iam_role.disconnect_lambda_exec_role: Refreshing state... [id=demo_disconnect_lambda_exec_role]
module.policy.aws_iam_role.message_lambda_exec_role: Refreshing state... [id=demo_message_lambda_exec_role]
module.policy.aws_iam_role.upload_file_s3_lambda_exec_role: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role]
module.policy.aws_iam_role.add_scenario_lambda_exec_role: Refreshing state... [id=demo_add_scenario_lambda_exec_role]
module.policy.aws_iam_role.get_universe_overview_lambda_exec_role: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role]
module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object: Refreshing state... [id=lambdas/demo/download_comparison_vs_peers_handler.zip]
module.buckets.aws_s3_bucket_object.message_function_object: Refreshing state... [id=lambdas/demo/message.zip]
module.buckets.aws_s3_bucket_object.get_roles_function_object: Refreshing state... [id=lambdas/demo/get_roles_handler.zip]
module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_public_companies_handler.zip]
module.buckets.aws_s3_bucket_object.get_metric_types_function_object: Refreshing state... [id=lambdas/demo/get_metric_types_handler.zip]
module.buckets.aws_s3_bucket_object.layer_libraries_object: Refreshing state... [id=layer/demo/layer_libraries.zip]
module.buckets.aws_s3_bucket_object.get_investment_year_report_function_object: Refreshing state... [id=lambdas/demo/get_investment_year_report_handler.zip]
module.buckets.aws_s3_bucket_object.upload_file_s3_function_object: Refreshing state... [id=lambdas/demo/upload_file_s3_handler.zip]
module.policy.aws_iam_role.update_data_lambda_exec_role: Refreshing state... [id=demo_update_data_lambda_exec_role]
module.buckets.aws_s3_bucket_object.validate_data_function_object: Refreshing state... [id=lambdas/demo/validate_data_handler.zip]
module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object: Refreshing state... [id=lambdas/demo/get_edit_modify_data_handler.zip]
module.buckets.aws_s3_bucket_object.get_company_details_function_object: Refreshing state... [id=lambdas/demo/get_company_details_handler.zip]
module.buckets.aws_s3_bucket_object.get_investment_year_options_function_object: Refreshing state... [id=lambdas/demo/get_investment_year_options_handler.zip]
module.buckets.aws_s3_bucket_object.change_company_publicly_function_object: Refreshing state... [id=lambdas/demo/change_company_publicly_handler.zip]
module.buckets.aws_s3_bucket_object.glue_trigger_function_object: Refreshing state... [id=lambdas/demo/glue_trigger_handler.zip]
module.buckets.aws_s3_bucket_object.get_user_details_function_object: Refreshing state... [id=lambdas/demo/get_user_details_handler.zip]
module.buckets.aws_s3_bucket_object.connect_function_object: Refreshing state... [id=lambdas/demo/connect.zip]
module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_company_report_vs_peers_handler.zip]
module.buckets.aws_s3_bucket_object.change_user_role_function_object: Refreshing state... [id=lambdas/demo/change_user_role_handler.zip]
module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object: Refreshing state... [id=lambdas/demo/get_investment_date_report_handler.zip]
module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object: Refreshing state... [id=lambdas/demo/assign_company_permissions_handler.zip]
module.network.aws_apigatewayv2_api.websocket_api: Refreshing state... [id=9cd29nbvb8]
module.buckets.aws_s3_bucket_object.delete_scenarios_function_object: Refreshing state... [id=lambdas/demo/delete_scenarios_handler.zip]
module.buckets.aws_s3_bucket_object.get_company_permissions_function_object: Refreshing state... [id=lambdas/demo/get_company_permissions_handler.zip]
module.policy.aws_iam_role.connect_lambda_exec_role: Refreshing state... [id=demo_connect_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_investment_date_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_investment_date_report_lambda_function]
module.buckets.aws_s3_bucket_object.register_function_object: Refreshing state... [id=lambdas/demo/register.zip]
module.buckets.aws_s3_bucket_object.get_users_function_object: Refreshing state... [id=lambdas/demo/get_users_handler.zip]
module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object: Refreshing state... [id=lambdas/demo/add_user_to_customer_group_handler.zip]
module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object: Refreshing state... [id=lambdas/demo/get_dynamic_report_handler.zip]
module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object: Refreshing state... [id=lambdas/demo/get_by_metric_report_handler.zip]
module.buckets.aws_s3_bucket_object.authorize_function_object: Refreshing state... [id=lambdas/demo/authorize_handler.zip]
module.logs.aws_cloudwatch_log_group.disconnect_lambda_function: Refreshing state... [id=/aws/lambda/demo_disconnect_lambda_function]
module.logs.aws_cloudwatch_log_group.get_investment_year_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_investment_year_report_lambda_function]
module.logs.aws_cloudwatch_log_group.delete_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_delete_scenarios_lambda_function]
module.logs.aws_cloudwatch_log_group.get_edit_modify_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_edit_modify_data_lambda_function]
module.logs.aws_cloudwatch_log_group.upload_file_s3_lambda_function: Refreshing state... [id=/aws/lambda/demo_upload_file_s3_lambda_function]
module.logs.aws_cloudwatch_log_group.change_company_publicly_lambda_function: Refreshing state... [id=/aws/lambda/demo_change_company_publicly_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_report_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_report_vs_peers_lambda_function]
module.logs.aws_cloudwatch_log_group.get_user_details_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_user_details_lambda_function]
module.policy.aws_iam_role.glue_trigger_lambda_exec_role: Refreshing state... [id=demo_glue_trigger_lambda_exec_role]
module.policy.aws_iam_role.edit_modify_data_lambda_exec_role: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role]
module.buckets.aws_s3_bucket_object.disconnect_function_object: Refreshing state... [id=lambdas/demo/disconnect.zip]
module.logs.aws_cloudwatch_log_group.get_by_metric_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_by_metric_report_lambda_function]
module.logs.aws_cloudwatch_log_group.add_investment_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_investment_lambda_function]
module.policy.aws_iam_role.get_comparison_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role]
module.policy.aws_iam_role.get_user_details_lambda_exec_role: Refreshing state... [id=demo_get_user_details_lambda_exec_role]
module.policy.aws_iam_role.register_lambda_exec_role: Refreshing state... [id=demo_register_lambda_exec_role]
module.policy.aws_iam_role.get_company_details_lambda_exec_role: Refreshing state... [id=demo_get_company_details_lambda_exec_role]
module.policy.aws_iam_role.add_user_to_customer_group_lambda_exec_role: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_comparison_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_comparison_vs_peers_lambda_function]
module.policy.aws_iam_role.authorize_lambda_invoke_role: Refreshing state... [id=demo_authorize_lambda_invoke_role]
module.logs.aws_cloudwatch_log_group.validate_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_validate_data_lambda_function]
module.policy.aws_iam_role.get_investment_year_report_lambda_exec_role: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role]
module.policy.aws_iam_role.get_investment_year_options_lambda_exec_role: Refreshing state... [id=demo_get_investment_year_options_lambda_exec_role]
module.policy.aws_iam_policy.lambda_glue_access: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_glue_access]
module.logs.aws_cloudwatch_log_group.verify_users_with_same_email_lambda_function: Refreshing state... [id=/aws/lambda/demo_verify_users_with_same_email_lambda_function]
module.policy.aws_iam_role.delete_scenarios_lambda_exec_role: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_metric_types_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metric_types_lambda_function]
module.policy.aws_iam_role.get_company_report_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.glue_trigger_lambda_function: Refreshing state... [id=/aws/lambda/demo_glue_trigger_lambda_function]
module.policy.aws_iam_role.assign_company_permissions_lambda_exec_role: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role]
module.policy.aws_iam_role.download_comparison_vs_peers_lambda_exec_role: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role]
module.buckets.aws_s3_bucket_object.edit_modify_data_function_object: Refreshing state... [id=lambdas/demo/edit_modify_data_handler.zip]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_logging_function_back]
module.policy.aws_iam_role.get_users_lambda_exec_role: Refreshing state... [id=demo_get_users_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.add_user_to_customer_group_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_user_to_customer_group_lambda_function]
module.buckets.aws_s3_bucket_object.add_investment_function_object: Refreshing state... [id=lambdas/demo/add_investment_handler.zip]
module.policy.aws_iam_role.get_investment_date_report_lambda_exec_role: Refreshing state... [id=demo_get_investment_date_report_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_roles_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_roles_lambda_function]
module.policy.aws_iam_role.get_edit_modify_data_lambda_exec_role: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.edit_modify_data_lambda_function: Refreshing state... [id=/aws/lambda/demo_edit_modify_data_lambda_function]
module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_comparison_vs_peers_handler.zip]
module.logs.aws_cloudwatch_log_group.get_users_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_users_lambda_function]
module.buckets.aws_s3_bucket_object.get_all_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_companies_handler.zip]
module.logs.aws_cloudwatch_log_group.get_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_permissions_lambda_function]
module.buckets.aws_s3_bucket_object.get_universe_overview_function_object: Refreshing state... [id=lambdas/demo/get_universe_overview_handler.zip]
module.policy.aws_iam_role.companies_lambda_exec_role: Refreshing state... [id=demo_companies_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_company_details_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_details_lambda_function]
module.logs.aws_cloudwatch_log_group.delete_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_delete_company_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_investments_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_investments_lambda_function]
module.buckets.aws_s3_bucket_object.delete_company_function_object: Refreshing state... [id=lambdas/demo/delete_company_handler.zip]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
module.policy.aws_iam_role.change_user_role_lambda_exec_role: Refreshing state... [id=demo_change_user_role_lambda_exec_role]
module.buckets.aws_s3_bucket_object.add_scenario_function_object: Refreshing state... [id=lambdas/demo/add_scenario_handler.zip]
module.logs.aws_cloudwatch_log_group.change_user_role_lambda_function: Refreshing state... [id=/aws/lambda/demo_change_user_role_lambda_function]
module.policy.aws_iam_role.verify_users_with_same_email_lambda_exec_role: Refreshing state... [id=demo_verify_users_with_same_email_exec_role]
module.logs.aws_cloudwatch_log_group.add_scenario_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_scenario_lambda_function]
module.logs.aws_cloudwatch_log_group.assign_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_assign_company_permissions_lambda_function]
module.policy.aws_iam_role.get_by_metric_report_lambda_exec_role: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.authorize_lambda_function: Refreshing state... [id=/aws/lambda/demo_authorize_lambda_function]
module.logs.aws_cloudwatch_log_group.connect_lambda_function: Refreshing state... [id=/aws/lambda/demo_connect_lambda_function]
module.policy.aws_iam_role.validate_data_lambda_exec_role: Refreshing state... [id=demo_validate_data_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_company_investments_function_object: Refreshing state... [id=lambdas/demo/get_company_investments_handler.zip]
module.logs.aws_cloudwatch_log_group.message_lambda_function: Refreshing state... [id=/aws/lambda/demo_message_lambda_function]
module.logs.aws_cloudwatch_log_group.get_investment_year_options_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_investment_year_options_lambda_function]
module.logs.aws_cloudwatch_log_group.get_universe_overview_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_universe_overview_lambda_function]
module.logs.aws_cloudwatch_log_group.get_dynamic_report_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_dynamic_report_lambda_function]
module.policy.aws_iam_role.get_all_public_companies_lambda_exec_role: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role]
module.policy.aws_iam_role.company_investments_lambda_exec_role: Refreshing state... [id=demo_get_company_investments_lambda_exec_role]
module.buckets.aws_s3_bucket_object.etl_script_object: Refreshing state... [id=pyspark/kpinetwork_analizer.py]
module.policy.aws_iam_role.get_metric_types_lambda_exec_role: Refreshing state... [id=demo_get_metric_types_lambda_exec_role]
module.buckets.aws_s3_bucket_object.update_data_function_object: Refreshing state... [id=lambdas/demo/update_data.zip]
module.policy.aws_iam_role.authorize_lambda_exec_role: Refreshing state... [id=demo_authorize_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.register_lambda_function: Refreshing state... [id=/aws/lambda/demo_register_lambda_function]
module.policy.aws_iam_role.delete_company_lambda_exec_role: Refreshing state... [id=demo_delete_company_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_all_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_companies_lambda_function]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/2e6953ea-c466-4ff3-baa9-7e8c3440affa]
module.policy.aws_iam_role_policy_attachment.add_investment_lambda_vpc: Refreshing state... [id=demo_add_investment_lambda_exec_role-20220524212704618600000002]
module.policy.aws_iam_role_policy_attachment.add_investment_lambda_logs: Refreshing state... [id=demo_add_investment_lambda_exec_role-20220524212705003500000004]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_vpc: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113048700000003]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_logs: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113047800000002]
module.policy.aws_iam_role_policy_attachment.disconnect_lambda_logs: Refreshing state... [id=demo_disconnect_lambda_exec_role-20220420102337857000000001]
module.policy.aws_iam_role_policy_attachment.disconnect_lambda_vpc: Refreshing state... [id=demo_disconnect_lambda_exec_role-20220503145603304000000001]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_vpc: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304159600000002]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_logs: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304155600000001]
module.policy.aws_iam_role_policy_attachment.get_dynamic_report_lambda_vpc: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role-20220707233328473300000001]
module.policy.aws_iam_role_policy_attachment.get_dynamic_report_lambda_logs: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role-20220707233328477200000002]
module.policy.aws_iam_role_policy_attachment.get_roles_lambda_logs: Refreshing state... [id=demo_get_roles_lambda_exec_role-20220201183736169200000001]
module.policy.aws_iam_role_policy_attachment.message_lambda_vpc: Refreshing state... [id=demo_message_lambda_exec_role-20220503145603314500000002]
module.policy.aws_iam_role_policy_attachment.message_lambda_logs: Refreshing state... [id=demo_message_lambda_exec_role-20220420120428768600000001]
module.policy.aws_iam_role_policy.upload_file_s3_policy: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role:demo_upload_file_s3_policy]
module.policy.aws_iam_role_policy_attachment.upload_file_s3_lambda_logs: Refreshing state... [id=demo_upload_file_s3_lambda_exec_role-20220411202109965800000001]
module.policy.aws_iam_role_policy_attachment.add_scenario_lambda_logs: Refreshing state... [id=demo_add_scenario_lambda_exec_role-20220615164627405600000001]
module.policy.aws_iam_role_policy_attachment.add_scenario_lambda_vpc: Refreshing state... [id=demo_add_scenario_lambda_exec_role-20220615164627406700000002]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_logs: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547100000001]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547200000002]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20220129002338871000000001]
module.network.aws_apigatewayv2_stage.stage: Refreshing state... [id=demo]
module.policy.aws_iam_role_policy_attachment.update_data_lambda_vpc: Refreshing state... [id=demo_update_data_lambda_exec_role-20220601154817160700000002]
module.policy.aws_iam_role_policy_attachment.update_data_lambda_logs: Refreshing state... [id=demo_update_data_lambda_exec_role-20220601154816818700000001]
module.policy.aws_iam_role_policy_attachment.connect_lambda_logs: Refreshing state... [id=demo_connect_lambda_exec_role-20220420102338091900000002]
module.policy.aws_iam_role_policy_attachment.edit_modify_data_lambda_logs: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role-20220621164117408200000002]
module.policy.aws_iam_role_policy_attachment.edit_modify_data_lambda_vpc: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role-20220621164117152800000001]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_logs: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220105181813257800000001]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917590600000002]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_logs: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917584000000001]
module.policy.aws_iam_role_policy_attachment.get_company_details_lambda_vpc: Refreshing state... [id=demo_get_company_details_lambda_exec_role-20220609204627925600000001]
module.policy.aws_iam_role_policy_attachment.get_company_details_lambda_logs: Refreshing state... [id=demo_get_company_details_lambda_exec_role-20220609204628035400000002]
module.policy.aws_iam_role_policy_attachment.register_lambda_vpc: Refreshing state... [id=demo_register_lambda_exec_role-20220503143910016300000001]
module.policy.aws_iam_role_policy_attachment.register_lambda_logs: Refreshing state... [id=demo_register_lambda_exec_role-20220427122624952100000001]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_glue_access: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916085000000001]
module.policy.aws_iam_role_policy_attachment.get_investment_year_options_lambda_vpc: Refreshing state... [id=demo_get_investment_year_options_lambda_exec_role-20220609204628072200000003]
module.policy.aws_iam_role_policy_attachment.get_investment_year_options_lambda_logs: Refreshing state... [id=demo_get_investment_year_options_lambda_exec_role-20220609204628159500000004]
module.policy.aws_iam_role_policy.authorize_lambda_invoke_policy: Refreshing state... [id=demo_authorize_lambda_invoke_role:demo_authorize_lambda_invoke_policy]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_vpc: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220216143110620800000001]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_logs: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220204083752775200000001]
module.policy.aws_iam_role_policy_attachment.get_investment_year_report_lambda_vpc: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role-20220526204729143000000002]
module.policy.aws_iam_role_policy_attachment.get_investment_year_report_lambda_logs: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role-20220526204729123500000001]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_logs: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916088000000002]
module.policy.aws_iam_role_policy_attachment.delete_scenarios_lambda_vpc: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role-20220623230436359500000001]
module.policy.aws_iam_role_policy_attachment.delete_scenarios_lambda_logs: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role-20220623230436404000000002]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_vpc: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917365700000001]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844121400000002]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_logs: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917367200000002]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_logs: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844110800000001]
module.policy.aws_iam_role_policy_attachment.download_comparison_vs_peers_lambda_logs: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role-20220316135744901200000002]
module.policy.aws_iam_role_policy_attachment.download_comparison_vs_peers_lambda_vpc: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role-20220316135744896400000001]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_logs: Refreshing state... [id=demo_get_users_lambda_exec_role-20220129002343661500000002]
module.network.aws_api_gateway_resource.companies: Refreshing state... [id=bnvar7]
module.network.aws_api_gateway_resource.roles: Refreshing state... [id=7w2rqf]
module.network.aws_api_gateway_resource.investment_date_report: Refreshing state... [id=ymo2z3]
module.network.aws_api_gateway_resource.by_metric_report: Refreshing state... [id=890crw]
module.network.aws_api_gateway_resource.upload_file_s3: Refreshing state... [id=u4or2w]
module.network.aws_api_gateway_resource.metrics: Refreshing state... [id=8rc63h]
module.network.aws_api_gateway_resource.company_report_vs_peers: Refreshing state... [id=mlpebw]
module.network.aws_api_gateway_resource.universe_overview: Refreshing state... [id=zr5b6w]
module.network.aws_api_gateway_resource.investments: Refreshing state... [id=bumysj]
module.network.aws_api_gateway_resource.comparison_vs_peers: Refreshing state... [id=ygo84c]
module.network.aws_api_gateway_resource.edit_modify: Refreshing state... [id=qybsqa]
module.network.aws_api_gateway_resource.users: Refreshing state... [id=837cdz]
module.network.aws_api_gateway_resource.dynamic_report: Refreshing state... [id=7ce5jh]
module.network.aws_api_gateway_resource.investment_report: Refreshing state... [id=iew1mv]
module.policy.aws_iam_role_policy_attachment.get_investment_date_report_lambda_vpc: Refreshing state... [id=demo_get_investment_date_report_lambda_exec_role-20220901212003397600000001]
module.policy.aws_iam_role_policy_attachment.get_investment_date_report_lambda_logs: Refreshing state... [id=demo_get_investment_date_report_lambda_exec_role-20220901212003402400000002]
module.policy.aws_iam_role_policy_attachment.companies_lambda_vpc: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145748993600000001]
module.policy.aws_iam_role_policy_attachment.get_edit_modify_data_lambda_logs: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role-20220623150403233500000001]
module.policy.aws_iam_role_policy_attachment.get_edit_modify_data_lambda_vpc: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role-20220623150403266900000002]
module.policy.aws_iam_role_policy_attachment.companies_lambda_logs: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145749002900000004]
module.policy.aws_iam_role_policy_attachment.change_user_role_lambda_logs: Refreshing state... [id=demo_change_user_role_lambda_exec_role-20220223170127368000000002]
module.policy.aws_iam_role_policy_attachment.change_user_role_lambda_vpc: Refreshing state... [id=demo_change_user_role_lambda_exec_role-20220223170127271200000001]
module.policy.aws_iam_role_policy_attachment.validate_data_lambda_vpc: Refreshing state... [id=demo_validate_data_lambda_exec_role-20220505163629032800000002]
module.policy.aws_iam_role_policy_attachment.validate_data_lambda_logs: Refreshing state... [id=demo_validate_data_lambda_exec_role-20220505163628999400000001]
module.policy.aws_iam_role_policy_attachment.verify_users_with_same_email_lambda_logs: Refreshing state... [id=demo_verify_users_with_same_email_exec_role-20220127183123476100000001]
module.policy.aws_iam_role_policy_attachment.get_by_metric_report_lambda_logs: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role-20220606213648088100000002]
module.policy.aws_iam_role_policy_attachment.get_by_metric_report_lambda_vpc: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role-20220606213648074600000001]
module.policy.aws_iam_role_policy_attachment.company_investments_lambda_logs: Refreshing state... [id=demo_get_company_investments_lambda_exec_role-20220524212704618600000003]
module.policy.aws_iam_role_policy_attachment.company_investments_lambda_vpc: Refreshing state... [id=demo_get_company_investments_lambda_exec_role-20220524212704613000000001]
module.policy.aws_iam_role_policy_attachment.get_metric_types_lambda_logs: Refreshing state... [id=demo_get_metric_types_lambda_exec_role-20220714150846115600000002]
module.policy.aws_iam_role_policy_attachment.get_metric_types_lambda_vpc: Refreshing state... [id=demo_get_metric_types_lambda_exec_role-20220714150845149600000001]
module.policy.aws_iam_role_policy_attachment.authorize_lambda_logs: Refreshing state... [id=demo_authorize_lambda_exec_role-20220113125137753300000001]
module.policy.aws_iam_role_policy_attachment.get_all_public_companies_lambda_vpc: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role-20220217204143307800000002]
module.policy.aws_iam_role_policy_attachment.get_all_public_companies_lambda_logs: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role-20220217204143305700000001]
module.policy.aws_iam_role_policy_attachment.delete_company_lambda_vpc: Refreshing state... [id=demo_delete_company_lambda_exec_role-20220630164119918000000001]
module.policy.aws_iam_role_policy_attachment.delete_company_lambda_logs: Refreshing state... [id=demo_delete_company_lambda_exec_role-20220630164119943200000002]
module.network.aws_api_gateway_resource.public_companies: Refreshing state... [id=4v8ab4]
module.network.aws_api_gateway_resource.change_company_publicly: Refreshing state... [id=eeb9pt]
module.network.aws_api_gateway_resource.company_details: Refreshing state... [id=hper4a]
module.network.aws_api_gateway_resource.by_metric_report_id: Refreshing state... [id=f4ao8c]
module.network.aws_api_gateway_resource.validate_data: Refreshing state... [id=pi6a5s]
module.network.aws_api_gateway_resource.metric_types: Refreshing state... [id=qg9lk5]
module.network.aws_api_gateway_resource.company_report_vs_peers_id: Refreshing state... [id=wycmf0]
module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=egpauc]
module.network.aws_api_gateway_resource.company_investments: Refreshing state... [id=jd2xz9]
module.network.aws_api_gateway_resource.comparison_vs_peers_id: Refreshing state... [id=jtuqjb]
module.network.aws_api_gateway_resource.dynamic_report_id: Refreshing state... [id=1c508f]
module.network.aws_api_gateway_resource.user: Refreshing state... [id=zhsk31]
module.functions.aws_lambda_layer_version.db_lambda_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18]
module.network.aws_api_gateway_resource.investment_report_id: Refreshing state... [id=ieupa8]
module.network.aws_api_gateway_resource.invest_year_options: Refreshing state... [id=gq814s]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/demo_rds_migrations]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.functions.aws_lambda_function.connect_lambda_function: Refreshing state... [id=demo_connect_lambda_function]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.policy.aws_iam_role_policy.allow_execute_api_message_connection: Refreshing state... [id=demo_message_lambda_exec_role:demo_allow_execute_api_message_connection_policy]
module.policy.aws_iam_role_policy.allow_execute_api_register_connection: Refreshing state... [id=demo_register_lambda_exec_role:demo_allow_execute_api_register_connection_policy]
module.policy.aws_lambda_permission.websocket_message: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_lambda_permission.websocket_connect: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_lambda_permission.websocket_register: Refreshing state... [id=AllowExecutionFromApiGateway]
module.policy.aws_lambda_permission.websocket_disconnect: Refreshing state... [id=AllowExecutionFromApiGateway]
module.network.aws_api_gateway_resource.scenarios: Refreshing state... [id=0bc6fs]
module.network.aws_api_gateway_resource.download_comparison_vs_peers: Refreshing state... [id=zgaw7c]
module.functions.aws_lambda_function.disconnect_lambda_function: Refreshing state... [id=demo_disconnect_lambda_function]
module.functions.aws_lambda_function.register_lambda_function: Refreshing state... [id=demo_register_lambda_function]
module.functions.aws_lambda_function.message_lambda_function: Refreshing state... [id=demo_message_lambda_function]
module.functions.aws_lambda_function.update_data_lambda_function: Refreshing state... [id=demo_update_data_lambda_function]
module.functions.aws_lambda_function.get_all_companies_lambda_function: Refreshing state... [id=demo_get_all_companies_lambda_function]
module.functions.aws_lambda_function.get_investment_year_options_lambda_function: Refreshing state... [id=demo_get_investment_year_options_lambda_function]
module.functions.aws_lambda_function.glue_trigger_lambda_function: Refreshing state... [id=demo_glue_trigger_lambda_function]
module.functions.aws_lambda_function.get_company_investments_lambda_function: Refreshing state... [id=demo_get_company_investments_lambda_function]
module.functions.aws_lambda_function.validate_data_lambda_function: Refreshing state... [id=demo_validate_data_lambda_function]
module.functions.aws_lambda_function.upload_file_s3_lambda_function: Refreshing state... [id=demo_upload_file_s3_lambda_function]
module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function: Refreshing state... [id=demo_verify_users_with_same_email_lambda_function]
module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function: Refreshing state... [id=demo_add_user_to_customer_group_lambda_function]
module.functions.aws_lambda_function.get_metric_types_lambda_function: Refreshing state... [id=demo_get_metric_types_lambda_function]
module.functions.aws_lambda_function.add_investment_lambda_function: Refreshing state... [id=demo_add_investment_lambda_function]
module.network.aws_api_gateway_resource.user_roles: Refreshing state... [id=npbrdw]
module.network.aws_api_gateway_resource.company_permissions: Refreshing state... [id=28s2ly]
module.functions.aws_lambda_permission.glue_trigger_event_permission: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2022-09-15 02:59:51.475 +0000 UTC]
module.cognito.aws_cognito_user_pool.pool: Refreshing state... [id=us-west-2_usXw4S12D]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_function]
module.cognito.aws_cognito_user_group.admin: Refreshing state... [id=us-west-2_usXw4S12D/demo_admin_group]
module.cognito.aws_lambda_permission.allow_post_confirmation_from_user_pool: Refreshing state... [id=AllowPostConfirmationFromUserPool]
module.functions.aws_lambda_function.get_edit_modify_data_lambda_function: Refreshing state... [id=demo_get_edit_modify_data_lambda_function]
module.cognito.aws_cognito_user_group.customer: Refreshing state... [id=us-west-2_usXw4S12D/demo_customer_group]
module.cognito.aws_cognito_user_pool_client.amplify: Refreshing state... [id=3917dpipsnpi2i8uofiovmn2jr]
module.functions.aws_lambda_function.change_company_publicly_lambda_function: Refreshing state... [id=demo_change_company_publicly_lambda_function]
module.functions.aws_lambda_function.get_user_details_lambda_function: Refreshing state... [id=demo_get_user_details_lambda_function]
module.functions.aws_lambda_function.get_universe_overview_lambda_function: Refreshing state... [id=demo_get_universe_overview_lambda_function]
module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_function]
module.functions.aws_lambda_function.delete_scenarios_lambda_function: Refreshing state... [id=demo_delete_scenarios_lambda_function]
module.functions.aws_lambda_function.get_dynamic_report_lambda_function: Refreshing state... [id=demo_get_dynamic_report_lambda_function]
module.functions.aws_lambda_function.get_company_details_lambda_function: Refreshing state... [id=demo_get_company_details_lambda_function]
module.policy.aws_iam_role_policy.get_investment_date_report_cognito_policy: Refreshing state... [id=demo_get_investment_date_report_lambda_exec_role:demo_get_investment_date_report_cognito_policy]
module.functions.aws_lambda_function.get_investment_date_report_lambda_function: Refreshing state... [id=demo_get_investment_date_report_lambda_function]
module.functions.aws_lambda_function.change_user_role_lambda_function: Refreshing state... [id=demo_change_user_role_lambda_function]
module.functions.aws_lambda_function.delete_company_lambda_function: Refreshing state... [id=demo_delete_company_lambda_function]
module.functions.aws_lambda_function.edit_modify_data_lambda_function: Refreshing state... [id=demo_edit_modify_data_lambda_function]
module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_function]
module.functions.aws_lambda_function.get_by_metric_report_lambda_function: Refreshing state... [id=demo_get_by_metric_report_lambda_function]
module.functions.aws_lambda_function.get_users_lambda_function: Refreshing state... [id=demo_get_users_lambda_function]
module.functions.aws_lambda_function.get_all_public_companies_lambda_function: Refreshing state... [id=demo_get_all_public_companies_lambda_function]
module.functions.aws_lambda_function.get_roles_lambda_function: Refreshing state... [id=demo_get_roles_lambda_function]
module.functions.aws_lambda_function.assign_company_permissions_lambda_function: Refreshing state... [id=demo_assign_company_permissions_lambda_function]
module.policy.aws_iam_role_policy.get_roles_cognito_policy: Refreshing state... [id=demo_get_roles_lambda_exec_role:demo_get_roles_cognito_policy]
module.policy.aws_iam_role_policy.download_comparison_vs_peers_cognito_policy: Refreshing state... [id=demo_download_comparison_vs_peers_lambda_exec_role:demo_download_comparison_vs_peers_cognito_policy]
module.policy.aws_iam_role_policy.get_by_metric_report_cognito_policy: Refreshing state... [id=demo_get_by_metric_report_lambda_exec_role:demo_get_by_metric_report_cognito_policy]
module.functions.aws_lambda_function.get_company_permissions_lambda_function: Refreshing state... [id=demo_get_company_permissions_lambda_function]
module.functions.aws_lambda_function.add_scenario_lambda_function: Refreshing state... [id=demo_add_scenario_lambda_function]
module.policy.aws_iam_role_policy.get_comparison_vs_peers_cognito_policy: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role:demo_get_comparison_vs_peers_cognito_policy]
module.functions.aws_lambda_function.get_investment_year_report_lambda_function: Refreshing state... [id=demo_get_investment_year_report_lambda_function]
module.policy.aws_iam_role_policy.get_edit_modify_data_cognito_policy: Refreshing state... [id=demo_get_edit_modify_data_lambda_exec_role:demo_get_edit_modify_data_cognito_policy]
module.policy.aws_iam_role_policy.change_user_role_cognito_policy: Refreshing state... [id=demo_change_user_role_lambda_exec_role:demo_change_user_role_cognito_policy]
module.policy.aws_iam_role_policy.edit_modify_data_cognito_policy: Refreshing state... [id=demo_edit_modify_data_lambda_exec_role:demo_edit_modify_data_cognito_policy]
module.policy.aws_iam_role_policy.get_investment_year_report_cognito_policy: Refreshing state... [id=demo_get_investment_year_report_lambda_exec_role:demo_get_investment_year_report_cognito_policy]
module.policy.aws_iam_role_policy.get_user_details_cognito_policy: Refreshing state... [id=demo_get_user_details_lambda_exec_role:demo_get_user_details_cognito_policy]
module.policy.aws_iam_role_policy.get_company_details_cognito_policy: Refreshing state... [id=demo_get_company_details_lambda_exec_role:demo_get_company_details_cognito_policy]
module.policy.aws_iam_role_policy.get_company_permissions_cognito_policy: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role:demo_get_company_permissions_cognito_policy]
module.policy.aws_iam_role_policy.get_universe_overview_cognito_policy: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role:demo_get_universe_overview_cognito_policy]
module.policy.aws_iam_role_policy.add_scenario_cognito_policy: Refreshing state... [id=demo_add_scenario_lambda_exec_role:demo_add_scenario_cognito_policy]
module.policy.aws_iam_role_policy.delete_scenarios_cognito_policy: Refreshing state... [id=demo_delete_scenarios_lambda_exec_role:demo_delete_scenarios_cognito_policy]
module.policy.aws_iam_role_policy.assign_company_permissions_cognito_policy: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role:demo_assign_company_permissions_cognito_policy]
module.policy.aws_iam_role_policy.get_company_report_vs_peers_cognito_policy: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role:demo_get_company_report_vs_peers_cognito_policy]
module.policy.aws_iam_role_policy.get_dynamic_report_cognito_policy: Refreshing state... [id=demo_get_dynamic_report_lambda_exec_role:demo_get_dynamic_report_cognito_policy]
module.policy.aws_iam_role_policy.delete_company_cognito_policy: Refreshing state... [id=demo_delete_company_lambda_exec_role:demo_delete_company_cognito_policy]
module.policy.aws_iam_role_policy.get_all_public_companies_cognito_policy: Refreshing state... [id=demo_get_all_public_companies_lambda_exec_role:demo_get_all_public_companies_cognito_policy]
module.policy.aws_iam_role_policy.change_company_publicly_cognito_policy: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role:demo_change_company_publicly_cognito_policy]
module.policy.aws_iam_role_policy.authorize_lambda_get_users_and_groups: Refreshing state... [id=demo_get_users_lambda_exec_role:demo_authorize_lambda_get_users_and_groups]
module.policy.aws_lambda_permission.allow_pre_signup_from_user_pool: Refreshing state... [id=AllowPreSignUpFromUserPool]
module.policy.aws_iam_policy.add_user_to_customer_group_policy: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_post_configuration_trigger_policy]
module.policy.aws_iam_role_policy.verify_users_with_same_email_lambda_list_users_policy: Refreshing state... [id=demo_verify_users_with_same_email_exec_role:demo_verify_users_with_same_email_lambda_list_users_policy]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.demo.kpinetwork.com_A]
module.functions.aws_lambda_function.authorize_lambda_function: Refreshing state... [id=demo_authorize_lambda_function]
module.network.aws_apigatewayv2_integration.disconnect_integration: Refreshing state... [id=usm7qx9]
module.network.aws_apigatewayv2_integration.register_integration: Refreshing state... [id=qzrgtru]
module.network.aws_apigatewayv2_integration.connect_integration: Refreshing state... [id=lov27i5]
module.network.aws_apigatewayv2_integration.message_integration: Refreshing state... [id=bwwsvap]
module.network.aws_api_gateway_authorizer.kpi_authorizer: Refreshing state... [id=3y14fs]
module.network.aws_api_gateway_method.delete_company_method: Refreshing state... [id=agm-kb7gblbu69-hper4a-DELETE]
module.network.aws_api_gateway_method.get_by_metric_report_method: Refreshing state... [id=agm-kb7gblbu69-f4ao8c-GET]
module.network.aws_api_gateway_method.get_universe_overview_method: Refreshing state... [id=agm-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_method.get_investment_date_report_method: Refreshing state... [id=agm-kb7gblbu69-ymo2z3-GET]
module.network.aws_api_gateway_method.get_investment_year_report_method: Refreshing state... [id=agm-kb7gblbu69-ieupa8-GET]
module.network.aws_api_gateway_method.get_roles_method: Refreshing state... [id=agm-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_method.get_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_method.get_company_details_method: Refreshing state... [id=agm-kb7gblbu69-hper4a-GET]
module.network.aws_api_gateway_method.delete_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-0bc6fs-DELETE]
module.network.aws_api_gateway_method.add_scenario_method: Refreshing state... [id=agm-kb7gblbu69-0bc6fs-POST]
module.network.aws_api_gateway_method.get_user_details_method: Refreshing state... [id=agm-kb7gblbu69-zhsk31-GET]
module.network.aws_api_gateway_method.dynamic_report_method: Refreshing state... [id=agm-kb7gblbu69-1c508f-GET]
module.network.aws_api_gateway_method.get_company_investments_method: Refreshing state... [id=agm-kb7gblbu69-jd2xz9-GET]
module.network.aws_api_gateway_method.validate_data_method: Refreshing state... [id=agm-kb7gblbu69-pi6a5s-POST]
module.network.aws_api_gateway_method.get_investment_year_options_method: Refreshing state... [id=agm-kb7gblbu69-gq814s-GET]
module.network.aws_api_gateway_method.get_users_method: Refreshing state... [id=agm-kb7gblbu69-837cdz-GET]
module.network.aws_api_gateway_method.edit_modify_data_method: Refreshing state... [id=agm-kb7gblbu69-qybsqa-PUT]
module.network.aws_api_gateway_method.download_comparison_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-zgaw7c-GET]
module.network.aws_api_gateway_method.get_company_report_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-wycmf0-GET]
module.network.aws_api_gateway_method.change_user_role_method: Refreshing state... [id=agm-kb7gblbu69-npbrdw-PUT]
module.network.aws_api_gateway_method.assign_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_method.add_investment_method: Refreshing state... [id=agm-kb7gblbu69-jd2xz9-POST]
module.network.aws_api_gateway_method.get_all_companies_method: Refreshing state... [id=agm-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_method.get_comparison_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_method.get_all_public_companies_method: Refreshing state... [id=agm-kb7gblbu69-4v8ab4-GET]
module.network.aws_api_gateway_method.change_company_publicly_method: Refreshing state... [id=agm-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_method.get_edit_modify_data_method: Refreshing state... [id=agm-kb7gblbu69-qybsqa-GET]
module.network.aws_api_gateway_method.get_metric_types_method: Refreshing state... [id=agm-kb7gblbu69-qg9lk5-GET]
module.network.aws_api_gateway_method.upload_file_s3_method: Refreshing state... [id=agm-kb7gblbu69-u4or2w-POST]
module.network.aws_apigatewayv2_route.connect_route: Refreshing state... [id=lb55rfq]
module.network.aws_apigatewayv2_route.register_route: Refreshing state... [id=f5rytev]
module.network.aws_apigatewayv2_route.message_route: Refreshing state... [id=b6359n3]
module.network.aws_apigatewayv2_route.disconnect_route: Refreshing state... [id=i6ilvcd]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_cognito_policy: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220107163139048600000001]
module.network.aws_api_gateway_integration.delete_company_integration: Refreshing state... [id=agi-kb7gblbu69-hper4a-DELETE]
module.network.aws_api_gateway_integration.investment_date_report_integration: Refreshing state... [id=agi-kb7gblbu69-ymo2z3-GET]
module.network.aws_api_gateway_integration.by_metric_report_integration: Refreshing state... [id=agi-kb7gblbu69-f4ao8c-GET]
module.network.aws_api_gateway_integration.get_roles_integration: Refreshing state... [id=agi-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_integration.universe_overview_integration: Refreshing state... [id=agi-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_integration.get_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_integration.investment_report_integration: Refreshing state... [id=agi-kb7gblbu69-ieupa8-GET]
module.network.aws_api_gateway_integration.delete_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-0bc6fs-DELETE]
module.network.aws_api_gateway_integration.get_company_details_integration: Refreshing state... [id=agi-kb7gblbu69-hper4a-GET]
module.network.aws_api_gateway_integration.user_details_integration: Refreshing state... [id=agi-kb7gblbu69-zhsk31-GET]
module.network.aws_api_gateway_integration.add_company_scenario_integration: Refreshing state... [id=agi-kb7gblbu69-0bc6fs-POST]
module.network.aws_api_gateway_integration.dynamic_report_integration: Refreshing state... [id=agi-kb7gblbu69-1c508f-GET]
module.network.aws_api_gateway_integration.company_investments_integration: Refreshing state... [id=agi-kb7gblbu69-jd2xz9-GET]
module.network.aws_api_gateway_integration.validate_data_integration: Refreshing state... [id=agi-kb7gblbu69-pi6a5s-POST]
module.network.aws_api_gateway_integration.invest_year_options_integration: Refreshing state... [id=agi-kb7gblbu69-gq814s-GET]
module.network.aws_api_gateway_integration.edit_modify_data_integration: Refreshing state... [id=agi-kb7gblbu69-qybsqa-PUT]
module.network.aws_api_gateway_integration.download_comparison_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-zgaw7c-GET]
module.network.aws_api_gateway_integration.users_integration: Refreshing state... [id=agi-kb7gblbu69-837cdz-GET]
module.network.aws_api_gateway_integration.company_report_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-wycmf0-GET]
module.network.aws_api_gateway_integration.change_user_role_integration: Refreshing state... [id=agi-kb7gblbu69-npbrdw-PUT]
module.network.aws_api_gateway_integration.add_investment_integration: Refreshing state... [id=agi-kb7gblbu69-jd2xz9-POST]
module.network.aws_api_gateway_integration.assign_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_integration.comparison_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_integration.public_companies_integration: Refreshing state... [id=agi-kb7gblbu69-4v8ab4-GET]
module.network.aws_api_gateway_integration.companies_integration: Refreshing state... [id=agi-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_integration.change_company_publicly_integration: Refreshing state... [id=agi-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_integration.get_edit_modify_data_integration: Refreshing state... [id=agi-kb7gblbu69-qybsqa-GET]
module.network.aws_api_gateway_integration.upload_file_s3_integration: Refreshing state... [id=agi-kb7gblbu69-u4or2w-POST]
module.network.aws_api_gateway_integration.get_metric_types_integration: Refreshing state... [id=agi-kb7gblbu69-qg9lk5-GET]
module.network.aws_apigatewayv2_deployment.deploy: Refreshing state... [id=ey3sgf]
module.policy.aws_lambda_permission.apigw_change_company_publicly_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayChangeCompanyPublicly]
module.policy.aws_lambda_permission.apigw_change_user_role_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayChangeUserRole]
module.policy.aws_lambda_permission.apigw_get_investment_year_options_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_delete_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyPermissions]
module.policy.aws_lambda_permission.apigw_get_edit_modify_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_add_scenario_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_by_metric_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_company_report_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_investment_date_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_add_investment_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAddInvestmentId]
module.policy.aws_lambda_permission.apigw_upload_file_s3_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayUploadFileS3]
module.policy.aws_lambda_permission.apigw_get_dynamic_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_investment_year_report_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_edit_modify_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_roles_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetRoles]
module.policy.aws_lambda_permission.apigw_company_investments_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyInvestmentsId]
module.policy.aws_lambda_permission.apigw_validate_data_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayValidateData]
module.policy.aws_lambda_permission.apigw_get_all_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_comparison_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_company_details_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_delete_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAddInvestmentId]
module.policy.aws_lambda_permission.apigw_get_users_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUsers]
module.policy.aws_lambda_permission.apigw_get_universe_overview_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_assign_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_user_details_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUserDetails]
module.policy.aws_lambda_permission.apigw_get_metric_types_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_download_comparison_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_all_public_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "e8ae68a063d48a88e442ae33538998a7" -> "ace27a6001eb402dfec6cc19a1ca881b"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "0a03b54dbf7777862104c011b9146ad6" -> "15f83c1bc9e75c5f8ed33ee1030ac7a9"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "5d658fae64b2fe3e84993ac13c5523d0" -> "707d43df2e01ffa88c47a6e357dc50b5"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "34d289c0f1b64214783e7fa1cfafe19c" -> "876172c50d83cbe8273ae154bdfeb9b6"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "e402e233ce3b0a905aee4b1fc8b07d95" -> "b50a6ed63a862b611396559748b5ad50"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "adc3a063803ad4484f3d783b325b43d1" -> "7865453485cbe0b631702d4bd1dd423a"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "53e7a12a65671e7458e49523a1382358" -> "6dd99a31a026155832050ec2049ef2c4"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "37613a7cbecd7e52383f9101894d2a39" -> "85bbca40ddb5ac4f8ca988192b28c45a"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "c0f0af14ad3ba8b44cec6c1c36920241" -> "f375e3447d9781aa840ae57211940706"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "e14a71797d87db2c5b0dc290869aa011" -> "865bc864edb8420e513ff90f1c3fd4cb"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "391df69e93d0f734dd890fbd532a8d21" -> "712e350bb4dc01b76ea169e2cbe46607"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "c01c96535aeebc5d6b01c94a6dbca349" -> "c91cc6db841430ec252003cdadc979c9"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "fa565c71578409f914451dd2661d2aa7" -> "11e81614fbb6df16ccc2ad6ad713ae7d"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "bf447ca29ca064b9a13a3d9a0ed2ad83" -> "7ae5e49f95f3a6729a0e9a2789c7371c"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "150d2e9d4fb8fe49d7e6613d8d1be38a" -> "659bf577272ccc16c0d015f7ba6a23cb"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "6fa54c7ba9a56a379636841bb866db77" -> "8a49d97eb2395105cc446fdecf09232b"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "e480e83f68b3bd2a8cbea3c941477cae" -> "31613ef2e5ef29d666805e53501af936"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "33c5ee4a8a6372cd16e23f21f3ec10aa" -> "059e245c9270cc4d02d2210c33118758"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "189eaa6783ba0f49a48ee338c70cbdf8" -> "337e9c17e61e1c7060f695f154928a18"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "76b5938aac9923fc9492a82aae0cc603" -> "b16dea775aaa659eb47beb1cbc9e0eaf"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "987274bcd2f7505486709baab0ec3f2e" -> "22e2f473c057527bd5b53d698cd44309"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "6d08d3305d800f08920b2b8cdced6876" -> "e293615ab93809f952c2a8d2fa5c92ba"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "4ce37fa6fd0f2b139f3e0eb9c3ce1019" -> "0cbd887eb57f7f5116ad08be03f73b80"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "dfa606572e5e057abae180ecc807d347" -> "57c957b4a0484de9dfd8e1ec4eade25d"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_year_options_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_year_options_function_object" {
      ~ etag               = "684f185c79bb0e39f9fad3014ac81bbd" -> "c8a0fc91f6a729366ae0e4df8cd1e09c"
        id                 = "lambdas/demo/get_investment_year_options_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_year_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_year_report_function_object" {
      ~ etag               = "65e3bba9f3aee918ec1c7bda261dd3e6" -> "5f6bce3d8bf618864a4782e7a0c33959"
        id                 = "lambdas/demo/get_investment_year_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "278396c6ebdd96a97ebfa934301d7a91" -> "5e9ea43e85f946219f9a187c006d2e2c"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "f812c087bbd6f6972e09e25a304e6f8b" -> "4e99e691a67a6767f9e1882578bc69f9"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "c76d0f13a113ebbc780f6ecb78713693" -> "9ea47fe6cc910516ef0cc8065d5637dd"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "4679859eef8c9cc6e54444ae4bbab1c8" -> "25cd8de02608ca795174c115b891140c"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "b20efd391ec32d1cfd048a3160b6188f" -> "e1738b7125ebebb2b36b223e6ea8e918"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "549822a994ce5b432e509ba1f9b6a503" -> "cfb7ca2afd3a7fb433abf25d5e7364a9"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "5cc342a983a33a300be3378ecb63788a" -> "213cc3385af478e3002c97af0487acc2"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "de79b9783f320c1890f826757da21d00" -> "4d97ada678519c656e0b38497984f86d"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "01d86ee1de3c2648278681245ae9e77d" -> "ca2d9ec7827eec0c0874f385059576b6"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "1b166293b8df793cb3532b16e9ba2817" -> "1957339360b5b7ad0f9e4a1d4aac0f2a"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "7512bbe0612168632ef711e9b7bde74a" -> "67fbb376c8833a35902498799f74fc3b"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "b485e1c6aef2bc77a6e6594330cc38f1" -> "4b5c3d1f2dd03399ff1684723ecdfae9"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "72cfab04c0ea64b2cda7267c9e23f41c" -> "dbc0c69a82a2d7b591fad2e7b3d0444a"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:36.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "FKWASc5FJobIYFrPmpCSVSfUHYXzY+gcgQhAa0A04F4=" -> "zDPlTWKiNZClmjx3s4peNR/mDJ8ZpYvPAzatdluWBq4="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:29.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "lBmJ/U8GMU+13LFF21JD0VQFhZ9zvJeq+29z2ykb7lk=" -> "QIf04vMZeuqYsVrV74NcVnDvZyvMKbrPakqFhw3N64Y="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:15.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "ywO88YCXCQbpHn9lLBKqcaW4h5mwySDDF4cor7r7Gtw=" -> "3iR5kqSt4nAR7ZlZa7YC/5JtFrRk8Gqd/hZlPNEJ/6w="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:55.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "1uNhjEk+t/9ExmW9qahC4W+XnKQkWgXC2T3Fq644JlM=" -> "eD8Oxqg7hU1llM5ACk+H11Sf6K4jRYQO5sYkuTYaETY="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:13.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "XPMrpbat0siP5GDDnljqsMP3NQ07Mep4UxMS6v1CL2Q=" -> "PztFmSfqPZL6puqLTp8bxhPHDMtb42IUZadSZqMit1Y="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:59.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "s/nvkvKn7UD6W3o04UVOvDIUtpu9+vmhmcbgIqlPV+o=" -> "8cgZvYvqMa7eYZtWNTdDmcGFNzTfEiB8Us1uQy13ttc="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:56.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "7/LYNONeBiJHT5V9d5ZR8E86il9MNlT5idwnwa7ke9g=" -> "A49QEi32gwcO9whfYZ0NPRTQCSkaVXH/GVTcKmGcCuw="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-09-19T15:09:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "5mB8DaoUxiPe2NsG0ufU+iNfpjz5GkYOeIGWe0ih09E=" -> "HPaJWQcZMn5eXWUKLX5MGDdRt7VzRMpSK+1Plfkhp5s="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-09-19T15:11:14.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "dYYfPGZxzDEnioMvjqzEYBTQn2wMxLnQQaY/tTgzIMQ=" -> "oPI4fANoLCkxEhhCflWB3QEYpdqZE8b7xJ8pzxHhFyE="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:56.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "05HAd3S/zUtxcwRABhNG/yEmo2mxN330pOf8p+6V2/k=" -> "VW/fYSQ+RtA8WEUbhwBJ6yPraozP1w0UbEe8bUD6tvI="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:35.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "elQmxq1McXdx4GszdLpWVu6Lvwum8Wk/LIOLuh9BFGw=" -> "tX8bcIRF6ArP2e1UzpPYsldRoZoBD+uBIQkNE2tx0Ho="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:57.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "4aCpWQ4x9B9wox5dqRigcNaCiCJ2LXkIgziBVt24vvI=" -> "RV4u91xgfORyN+W8rvzcNcyNMlK+xiAagC+pk1acGVM="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:55.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "Qf+PmN5WopRHq0mV+dlcsLoQGjZtwbHpoaf03CvQAL0=" -> "5nOQR1A+w6iNbFrysbaUXgF9PQi3W5KLuQOW0Kty9vQ="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:17.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "vB2LgeopDw37JeEKQUMS3npeawQRADJQU783tQyJrZI=" -> "b1Pgrrrg3WB24fARMc/9gJfAEhdNiDFI9+TBbT+mxZQ="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:36.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "FffxGvbWtHUUavIhJrVhGdtXO6JDapVssldQnYcLhCE=" -> "3oOEQIYXBGpJ1dnn+LVGAkO+1Io8cd5+77eOBcdQXyM="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:34.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "0U8EpVJyd/6rocU77s04eNYqg+F3H2e1oXxuJmjClj8=" -> "XXceWHzSHLl7a0FQV9bos6tmuY9t/iWVMRqj+IRCvXU="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:13.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "zqjs1HmRaXfYctaADOd9ZLLRERYyn/DMsFQ796g39Uw=" -> "QOC+RxSOYDx2a/9StN3FnB3TwsUQyOizW5QgN84+wL8="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:16.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "fBlRwDt8+DaJWc/8NjAKIjhELqmB8Fv7ZQYUMfVKIZE=" -> "JFq1kaj6OCj0Enmstq1te9C8c4b5xs3aNsrrij/yqJY="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:55.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "71+lHlBTEDATrNv3PdRcS9Z5EuVNxUwse/LkHmgSnps=" -> "y4w3EkVTjGfvrzWQd4ZRJCpKkewCz8D0K+IR6lRR/nI="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:55.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "yq5RUlNyDdxP3XRV5okIPjA2UGhJrQuW3Lq8xW8XD+Q=" -> "NsTynzWEiR20y5Xh7+x2fCY7e+CrDJuN61fQkz3zJ5c="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:33.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "F3urcm7A98XH9ar5QKjfE/LnucZ9upEWWXYThcpc8R4=" -> "qTfVkjeSkg/oqpRwTlJ3TDTvQqNpf5tiGtSApcJ2t0U="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:34.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "EULTQcEwngYG2MbffmSPWPq/XWHtd2Q12+D0AH+KUvM=" -> "jXOV+xYA8xKLRH6XAAqWIn7FSXPwJ1XpHkABCyAJyUM="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "fkLFZ7ym+nAfgztwmFILTt8B0iY04en3SEx7bFBuYd0=" -> "H5CKVvd0/sPy+TGiXaj+vrO4luYMceW+BUrHnzzwsYQ="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-09-19T15:11:13.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "Txhl7fHYLArDVWcQpRecV5haTYNbT2+f+k3y45HFmYg=" -> "v6lPvzC+L7Or90I2Mj4M2RMnpXJq9SUjoP6Z0YNhlz4="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_year_options_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_year_options_lambda_function" {
        id                             = "demo_get_investment_year_options_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:15.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "6niZQQ2MfmTVskYfKYyNeLuf7/VVhvm6mxCqYGvwWIM=" -> "k2VxED77Bh3WRgiyRhO+kfP7Ae9Y4qc6KnBWDfcAVhk="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_year_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_year_report_lambda_function" {
        id                             = "demo_get_investment_year_report_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:55.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "4HVziZd09NtU9m0Mw6hLVseXwQWAikWJoug5XrifV2g=" -> "WS857GwqPHQaWUBQFVgWGQ979D4m1oMdpuyRUc18BXc="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-09-19T15:11:17.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "zav9panO+OQz9rbbtX2OHxlkE4eVOmj3ynYdE3xlpRo=" -> "8tUJnGXaFJI5M22nos1lZZBWjaYpXh/mRj4lMdUowpA="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:35.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "lRXt9iqzX3PZsLkfiD1gjB3RG25xyN4diufLHxwIJFU=" -> "tPSyVS/Pumfe+nS6FffbgxwCUtupk+gHbLzniIvMPDw="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-09-19T15:11:14.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "szzSaTn3kua79Sej5B+dMX3JwfdfJbQNX9zPTh4My+Q=" -> "z4hCyRQC3OofEcuMzY6Hs0OObLLtXsHrvOZr+q1dUEs="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:16.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "nSv7gQAeLIcyIv1SwqCT1abK1EPuUSlVTfPnaL9qvP0=" -> "Gl8TVP8Q8LC6kxGi3JE+MxaY7JTH04iSIGbfmxUScjc="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-09-19T15:11:15.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "lXFNpjh8yHdhCBMwRlMiKi6Lif7oIRZ/jWJCdNbxyXc=" -> "m+m+OCkFXmCOEjpAv50tXvW72NCAHeJfhcm9woZ5WgI="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:14.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "kUiAdrURsDbLhqCe10dNapV1Z/LvKKoOv+TASzDKtTI=" -> "PKue2AXPN4SPVKkj93840HFM3/2Ka7/R7GR07UXpFrY="
        tags                           = {}
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:13.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "+ejYnX54SRnZoLoHkLOhkumR0Ym2n6eauBsFoIsevcM=" -> "zunnXG1N0MLYzs6NVwWs2S5z+l4EPPKmthslCbS3neo="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:14.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "7Glnp67X49wyBuzuMtSrKyUYmTdCy/O5F4GqUo2wQ7s=" -> "GXdlUrvhNM8wqympFhc3FKQF2cglGpbuM6x2Sp1s8lY="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:37.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "71eRODq/o4qabMiNu4xQed7wZjEGfKx39PdmvZhQuYY=" -> "B+URzX3ox0llr9dtGT2wf5HuzKZLLsa1eW4oljBpFjQ="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-09-19T15:10:54.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "RnVVPPz06QpkYNj0be5UG8LHTfFbib2UlSEiNNgjufY=" -> "H55ZGDf6EOyirfRT5XlHrI+GHqWcT9GLTMsGtZq6E8I="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-09-19T15:11:14.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "VaM10iCnA2hGqOczBMVkKmEiFoVylTMtvFwlxsirN4g=" -> "zlL5f7Joy1qxGEB92s1fDdg/O2Cnlk4jtALMDGtK8r8="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-09-19T15:11:16.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18",
        ] -> (known after apply)
      ~ source_code_hash               = "CYWyQ2x/5xHAOw8S+sxzuxIobJfB+EpIlY46drQSf4U=" -> "EsNv6rM0DMXBNL29r2RGCwnOrY9vRD8/F17azIS+xvU="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_layer_version.db_lambda_layer must be replaced
+/- resource "aws_lambda_layer_version" "db_lambda_layer" {
      ~ arn                         = "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18" -> (known after apply)
      ~ created_date                = "2022-09-19T15:10:01.678+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:18" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "11ACZsnbW8iaSNMbPxVBY8tQt4EZlAHNN40rF+5xrVE=" -> "yOiiEyjPkv1vQ1Z7jW7mCm/RtgR25y4NOj6knMy/z/w=" # forces replacement
      ~ source_code_size            = 34940715 -> (known after apply)
      ~ version                     = "18" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-09-19T15:09:51Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "egpauc" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-09-19T15:09:50Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-09-19T15:09:49Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 79 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*